'''1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.'''
def my_div(arg_1 = input("Укажите делимое: "), arg_2 = input("Укажите делитель: ")):
    try:
        return int(arg_1) / int(arg_2)
    except ZeroDivisionError:
        print("Делить на ноль нельзя!")
    except ValueError:
    	print('Введено не число!')       
print(my_div())