'''1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
который должен принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
Примеры матриц вы найдете в методичке.
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции сложения двух
объектов класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки
первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.'''

class Matrix:
    def __init__(self, arr_1, arr_2):
        self.arr_1 = arr_1
        self.arr_2 = arr_2

    def __add__(self):
        matrix = [[0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0]]

        for i in range(len(self.arr_1)):

            for j in range(len(self.arr_2[i])):
                matrix[i][j] = self.arr_1[i][j] + self.arr_2[i][j]

        return str('\n'.join(['\t'.join([str(j) for j in i]) for i in matrix]))


    def __str__(self):
        return str('\n'.join(['\t'.join([str(j) for j in i]) for i in matrix]))



new_matrix = Matrix([[5, 18, 11, 2, 12],
                    [6, 17, 23, 3, 15],
                    [71, 16, 92, 4, 20],
                    [41, 50, 9, 2, 40],],
                   [[3, 1, 13, 22, 31],
                    [6, 70, 23, 33, 18],
                    [15, 58, 4, 4, 20],
                    [41, 70, 93, 4, 20],])

print(new_matrix.__add__())
     