'''Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, 
что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл. 
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.'''

# a)
from itertools import count
start_num = int(input("Введите первое число цикла: "))
end_num = int(input("Введите последнее число цикла: "))
for el in count(start_num):
    if el > end_num:
        break
    else:
        print(el)

# б)
from itertools import cycle

cycl = 0
end_cyc = int(input("Введите количество повторов цикла: "))
for el in cycle([1, "w", 125, True]):
    if cycl > end_cyc:
        break
    print(el)
    cycl += 1
